app/controllers/api/cards_controller.rb

  def create
    @card = Card.new(card_params)
    @card.list_id = params[:list_id]

    if @card.save
---
INSERT INTO "cards" ("title", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "sdaf"], ["list_id", 22], ["created_at", "2020-06-29 19:17:10.855815"], ["updated_at", "2020-06-29 19:17:10.855815"]]

  def show
    @card = Card.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def update
    @card = Card.find(params[:id])

    if @card.update(card_params)
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
UPDATE "cards" SET "title" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["title", "Card 2 of List 2asdfdsfs"], ["updated_at", "2020-07-02 16:22:06.672862"], ["id", 34]]