app/controllers/api/cards_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def show
    @card = Card.find(params[:id])

    if @card
      @list = @card.list
      @board = @list.board
      render 'api/cards/show', status: 201
    else
      @error = @card.errors.full_messages.join(', ')