app/controllers/api/comments_controller.rb

  def create
    @comment = Card.find(params[:card_id]).comments.new(comment_params)

    if @comment.save
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 54], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "asdfcd"], ["card_id", 54], ["created_at", "2020-07-03 16:25:17.686306"], ["updated_at", "2020-07-03 16:25:17.686306"]]