app/controllers/api/lists_controller.rb

  def create
    board = Board.find(params[:board_id])
    @list = List.new(list_params)
    @list.board_id = board.id

    if @list.save
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "lists" ("title", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["board_id", 4], ["created_at", "2020-06-25 22:00:12.932203"], ["updated_at", "2020-06-25 22:00:12.932203"]]

  def update
    @list = List.find(params[:id])

    if @list.update(list_params)
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "lists" SET "title" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["title", "New list updated asfd"], ["updated_at", "2020-06-26 19:19:44.678915"], ["id", 13]]